network/lib/tasks/json_users.rake

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    task users: :environment do
        require 'json'

        file_path = Rails.root.join('db', 'data', 'users.json')

        if File.exist?(file_path)
        file = File.read(file_path)
        users = JSON.parse(file)

        users.each do |user_data|
            email = user_data['email']
            password = user_data['password']

            User.create(email: email, password: password) # Devise will handle password encryption